# melt

In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [7]:
# id_vars:充当ID的变量名  value_vars 充当值的变量的名称，也就是要 melt的变量的名称。
df.melt(id_vars='A', value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

自定义列名和ID名

In [8]:
df.melt(id_vars='A', value_vars=['B', 'C'], var_name='varname', value_name='valuename')

   A varname  valuename
0  a       B          1
1  b       B          3
2  c       B          5
3  a       C          2
4  b       C          4
5  c       C          6